app/controllers/cart_items_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT SUM("cart_items"."price") FROM "cart_items" WHERE "cart_items"."user_id" = ?  [["user_id", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."p_id" = ?  [["user_id", 1], ["p_id", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT SUM("cart_items"."price") FROM "cart_items"
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 13], ["LIMIT", 1]]
---
    def index
        @user = User.find(params[:user_id])
        count = 0

        if(params.key?("title"))
            @cart_items = @user.cart_items.where(title: params[:title])
        elsif(params.key?("price"))
            @cart_items = @user.cart_items.where(price: params[:price])
        elsif(params.key?("inventory_count"))
            @cart_items = @user.cart_items.where(inventory_count: params[:inventory_count])
        elsif(params.key?("p_id"))
            @cart_items = @user.cart_items.where(p_id: params[:p_id])
        elsif(params.key?("id"))
            @cart_items = @user.cart_items.where(id: params[:id])
        else
            @cart_items = @user.cart_items.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 14], ["LIMIT", 1]]
---
    def show
        @user = User.find(params[:user_id])
        @cart_item = @user.cart_items.find(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("user_id", "title", "price", "inventory_count", "p_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "Shirt1"], ["price", 20.0], ["inventory_count", 3], ["p_id", 1], ["created_at", "2019-01-14 08:43:49.407405"], ["updated_at", "2019-01-14 08:43:49.407405"]]
---
    def addtocart
        @product = Product.find(params[:id])
        if @product.inventory_count != 0
            @user = User.find(params[:user_id])
            @cart_item = @user.cart_items.create!(title: @product.title, price: @product.price, inventory_count: @product.inventory_count, p_id:@product.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 9], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."inventory_count" != ?  [["user_id", 1], ["inventory_count", 0]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?   [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "inventory_count" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["inventory_count", 2], ["updated_at", "2019-01-10 09:45:28.693613"], ["id", 8]]
UPDATE "products" SET "inventory_count" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["inventory_count", 3], ["updated_at", "2019-01-14 02:57:12.730172"], ["id", 1]]
INSERT INTO "purchased_items" ("user_id", "title", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "Shirt1"], ["price", 20.0], ["created_at", "2019-01-14 02:57:12.746136"], ["updated_at", "2019-01-14 02:57:12.746136"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 13]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 14]]
---
    def complete
        @user = User.find(params[:user_id])
        @cart_items = @user.cart_items.where.not(inventory_count: 0)

        @cart_items.each do |item|
            Product.transaction do
                i = Product.lock.find(item.p_id)
                i.inventory_count = item.inventory_count - 1
                i.save!
                @user.purchased_items.create(title: i.title, price: i.price)
                item.destroy
            end
        end

        # To reset id from 1 if cart is empty
        if(CartItem.count == 0)
            CartItem.destroy_all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]
SELECT COUNT(*) FROM "cart_items"
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 7]]
---
    def removefromcart
        @user = User.find(params[:user_id])
        @cart_item = @user.cart_items.find(params[:id])
        @cart_item.destroy

        if(CartItem.count == 0)
            CartItem.destroy_all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ?  [["user_id", 1]]
SELECT SUM("cart_items"."price") FROM "cart_items" WHERE "cart_items"."user_id" = ?  [["user_id", 1]]
---
        def get_total_price
            @user = User.find(params[:user_id])
            @total_price = @user.cart_items.sum("price")

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ?  [["user_id", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."id" = ? LIMIT ?   [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "cart_items"
---
        def update_count
            @user = User.find(params[:user_id])
            @cart_items = @user.cart_items.all
            @cart_items.each do |item|
                @user.cart_items.transaction do
                    i = @user.cart_items.lock.find(item.id)
                    product = Product.find(i.p_id)
                    if i.inventory_count != product.inventory_count
                        i.inventory_count = product.inventory_count
                        i.save!
                    end

                    if i.inventory_count == 0
                        i.destroy
                    end
                end
            end

            if(CartItem.count == 0)