app/controllers/products_controller.rb

    def update
        @product = Product.find(params[:id])
        @product.update(product_params)
---
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "updated"], ["updated_at", "2019-01-11 10:21:59.660114"], ["id", 980190962]]