app/controllers/products_controller.rb

    def index
        if(params.key?("title"))
            @products = Product.where(title: params[:title])
        elsif(params.key?("price"))
            @products = Product.where(price: params[:price])
        elsif(params.key?("inventory_count"))
            @products = Product.where(inventory_count: params[:inventory_count])
        elsif(params.key?("id"))
            @products = Product.where(id: params[:id])
        else
            @products = Product.all
---
SELECT  "products".* FROM "products" WHERE "products"."title" = ? LIMIT ?  [["title", "Shirt1"], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."inventory_count" = ? LIMIT ?  [["inventory_count", 0], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def available
        @products = Product.where.not(inventory_count: 0)
---
SELECT "products".* FROM "products" WHERE "products"."inventory_count" != ?  [["inventory_count", 0]]

    def create
        @product = Product.create!(product_params)
---
INSERT INTO "products" ("title", "price", "inventory_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Shirt1"], ["price", 20.0], ["inventory_count", 2], ["created_at", "2019-01-09 15:26:57.856247"], ["updated_at", "2019-01-09 15:26:57.856247"]]

    def update
        @product = Product.find(params[:id])
        @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "inventory_count" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["inventory_count", 5], ["updated_at", "2019-01-10 09:38:55.050377"], ["id", 1]]