app/controllers/purchased_items_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "purchased_items".* FROM "purchased_items" WHERE "purchased_items"."user_id" = ? AND "purchased_items"."title" = ?  [["user_id", 1], ["title", "Shirt1"]]
SELECT SUM("purchased_items"."price") FROM "purchased_items" WHERE "purchased_items"."user_id" = ?  [["user_id", 1]]
SELECT  "purchased_items".* FROM "purchased_items" WHERE "purchased_items"."user_id" = ? AND "purchased_items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def index
        @user = User.find(params[:user_id])
        count = 0

        if(params.key?("title"))
            @purchased_items = @user.purchased_items.where(title: params[:title])
        elsif(params.key?("price"))
            @purchased_items = @user.purchased_items.where(price: params[:price])
        elsif(params.key?("inventory_count"))
            @purchased_items = @user.purchased_items.where(inventory_count: params[:inventory_count])
        elsif(params.key?("id"))
            @purchased_items = @user.purchased_items.where(id: params[:id])
        else
            @purchased_items = @user.purchased_items.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "purchased_items".* FROM "purchased_items" WHERE "purchased_items"."user_id" = ? AND "purchased_items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def show
        @user = User.find(params[:user_id])
        @purchased_item = @user.purchased_items.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT SUM("purchased_items"."price") FROM "purchased_items" WHERE "purchased_items"."user_id" = ?  [["user_id", 1]]
---
        def get_total_price
            @user = User.find(params[:user_id])
            @total_price = @user.purchased_items.sum("price")