app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "User1"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        if(params.key?("name"))
            @users = User.where(name: params[:name])
        elsif(params.key?("id"))
            @users = User.where(id: params[:id])
        else
            @users = User.all

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "User1"], ["created_at", "2019-01-10 08:09:13.248817"], ["updated_at", "2019-01-10 08:09:13.248817"]]
---
    def create
        @user = User.create!(user_params)