app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "updated"], ["updated_at", "2019-01-11 10:34:28.158031"], ["id", 980190962]]
---
    def update
        @user = User.find(params[:id])
        @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]
---
    def destroy
        @user = User.find(params[:id])
        @user.destroy